/*Подумать над глобальными сущностями. 
К примеру, сущность «Продукт» в интернет-магазине актуальна 
не только для корзины, но и для каталога. 
Стремиться нужно к тому, чтобы объект «Продукт» имел 
единую структуру для различных модулей сайта, 
но в разных местах давал возможность вызывать разные методы. */

/*Свойства: артикул, название, цена, фотография, остаток на складе, описание, характеристики.
Методы: 
1. просмотр в каталоге (фото, название, цена, артикул, описание)
2. подробный просмотр товара (все свойства)
3. добавить в корзину (фото, название, цена, артикул, описание, количество)

const products = {
    code: [],
    name: [],
    price: [],
    foto: [],
    remaind: [],

    watch() {},
    inDetail() {},
    addToBasket() {}
}*/
