/*Объявить две целочисленные переменные a и b и задать им произвольные начальные значения. Затем написать скрипт, который работает по следующему принципу:
если a и b положительные, вывести их разность;
если а и b отрицательные, вывести их произведение;
если а и b разных знаков, вывести их сумму; ноль можно считать положительным числом.*/

function foo() {
    let a = parseInt(prompt('Введите первое число: '));
    let b = parseInt(prompt('Введите второе число: '));

    if (isNaN(a) || isNaN(b)) {
        alert('Необходимо ввести два числа');
        foo();
        return;
    }

    if (a >= 0 && b >= 0) {
        alert('a - b = ' + (a - b));
    } else if (a < 0 && b < 0) {
        alert('a * b = ' + (a * b));
    } else {
        alert('a + b = ' + (a + b));
    }
}

foo();
