// Дан код:
var a = 1, b = 1, c, d;
c = ++a; alert(c);           // 2
d = b++; alert(d);           // 1
c = (2+ ++a); alert(c);      // 5
d = (2+ b++); alert(d);      // 4
alert(a);                    // 3
alert(b);                    // 3
// Почему код даёт именно такие результаты?
alert(
'c = ++a; alert(c); - префиксная запись инкремента, сначала происходит увеличение значения\n\
d = b++; alert(d); - постфиксная запись, сначала возврат значения (пока b = 1)\n\
c = (2+ ++a); alert(c); 2 + 3 = 5, где 3 будет в результате операции ++a\n\
d = (2+ b++); alert(d); 2 + 2 = 4, b++ - постфиксная запись, сначала возврат значения (b = 2)\n\
a = 3, т.к. к переменной a применили 2 раза оперцию инкремента\n\
b = 3, т.к. к переменной b применили 2 раза оперцию инкремента'
);
